{
	"log_to_xlsx_input": {
		"log_file_name": "Your log file to be run",
		"log_file_path": "Set to your storage location. If blank, uses the file path of the sample data. NOTE: file paths need // as separators.",
        "excel_data_file_path": "Destination for the generated excel data. If blank, creates folder in the current directory",
		"date": "YYYYMMDD",
		"flight_number": "Flight number on the date specified. These can contain a "." for sub-flight numbering."
	},
	
	"flight_log_generator_input": {		
		"template_file_path": "If blank, finds the default template location",
		"template_file_name": "If blank, uses the default template",
		"csv_flight_data_name": "Name of correctly formatted CSV data. If blank, uses the name of the sample data",
        "csv_flight_data_file_path": "Path to CSV data. If blank, finds the path to the sample data",
        "metar_file_path": "METAR data collected will be stored here. If blank, creates folder in the current directory",
        "flight_log_destination": "Destination for the generated flight logs. If blank, creates folder in the current directory",
		"start_time_hours": "HH - 24 hr clock",
		"end_time_hours": "HH - 24 hr clock"
	},
	
	"weather_data": {
		"Action_time_hh:mm": "Time the weather data was recorded as hh:mm",
		"Temperature_C": "Temperature recorded on the ground in celsius",
		"Pressure_Pa": "Pressure recorded in Pascal",
		"Wind_speed_mps": "Wind speed recorded in meters per second (mps)",
		"Wind_direction_degrees": "Wind direction recorded in degrees from North"
	},
	
	"runway_data": {
		"Take_off_direction": "This should be entered in degrees with North being 0",
		"Runway_surface": "What material is the runway? E.g. tarmac/concrete/grass/dirt/ect.",
		"Surface_condition": "What condition is the runway in? E.g. dry/wet/icy/dusty/damaged/ect."
	},

	"aircraft_data": {
		"m_empty_kg": "Empty mass of the aircraft in kg",
		"m_fuel_kg": "Mass of any consumable fuel in kg",
		"m_fuel_final_kg": "Final fuel quantity after the mission is finished",
		"b_m": "Wing span from wing tip to wing tip in m",
		"S_m2": "Projected wing area (c * b) in m^2",
		"c_m": "Mean Aerodynamic Chord in m",
		"e": "Oswald span efficiency (dependent on your planform shape)",
		"alpha_setting_deg": "Wing angle of attack offset relative to the fuselage (setting angle) in degrees"
	}

}